# Sorting and Ranking

In [40]:
import pandas as pd
import seaborn as sns
import numpy as np

In [2]:
titanic = sns.load_dataset("titanic")

In [39]:
ages = titanic.sort_values("age",ascending=True).head(10)
twoFactor = titanic.sort_values(["pclass","fare"],ascending=[True,True]).head()
sIndex = titanic.sort_index().head()
print(sIndex) # when you know the index are outplaced meaning the positions are not up with indexs using sort_index makes it algined with actual index value position

   survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0         0       3    male  22.0      1      0   7.2500        S  Third
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone
0    man        True  NaN  Southampton    no  False
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True
3  woman       False    C  Southampton   yes  False
4    man        True  NaN  Southampton    no   True

# Grouping and Aggregation

In [12]:
print(titanic.groupby("pclass")["age"].mean())
print(titanic.groupby('pclass')["age"].agg(["mean","min","max","count","sum"]))

pclass
1    38.233441
2    29.877630
3    25.140620
Name: age, dtype: float64
             mean   min   max  count      sum
pclass
1       38.233441  0.92  80.0    186  7111.42
2       29.877630  0.67  70.0    173  5168.83
3       25.140620  0.42  74.0    355  8924.92

- ðŸ“Œ Phase 4: Handling Missing Data
- ðŸ“Œ Phase 5: Apply Functions

# Concatenation, Merging and Join

In [32]:
# Concatenantion

df = pd.DataFrame({'A':[1,2],'B':[3,4]})
df1 = pd.DataFrame({'A':[1,2],'B':[3,4]})

pd.concat([df,df1],axis=1)
# by default it's in vertical stack that is axis=0

   A  B  A  B
0  1  3  1  3
1  2  4  2  4

In [38]:
# Merge

l = pd.DataFrame({"id":[1,2,3],"name":["Javed","Nika","Luffy"]})
r = pd.DataFrame({"id":[2,3,4],"marks":[98,99,33]})

pd.merge(l,r, on="id",how="inner")

# how="inner": matches the right and left and shows that only.
# how="left" : shows the left all and fills missing right with NaN.
# how="right": shows the all right and fills missing left with NaN.
# how="outer": shows both and fills missing with NaN.

   id   name  marks
0   2   Nika     98
1   3  Luffy     99

In [34]:
# Joins

df = pd.DataFrame({"name":["Javed","Nika","Luffy"]}, index=['a','b','c'])
df2 = pd.DataFrame({"marks":[99,98,33]},index=['a','b','c'])

df.join(df2)

    name  marks
a  Javed     99
b   Nika     98
c  Luffy     33

# Missing Values

In [47]:
df = pd.DataFrame({
    'Name': ['Alice','Bob','Charlie','David'],
    'Age': [25, np.nan, 30, np.nan],
    'Fare':[100, 200, np.nan, 150]
})

# print(df.isnull())
print(df.isnull().sum())

Name    0
Age     2
Fare    1
dtype: int64

In [46]:
# dropna() removes columns or rows with missing values

df.dropna() # default rows
df.dropna(axis=1)

      Name
0    Alice
1      Bob
2  Charlie
3    David

In [53]:
# fillna() fills the missing values with provided value.

df['Age'].fillna(df['Age'].mean())
df.fillna(method='ffill')

C:\Users\Administrator\AppData\Local\Temp\ipykernel_12188\321136070.py:4: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill')

      Name   Age   Fare
0    Alice  25.0  100.0
1      Bob  25.0  200.0
2  Charlie  30.0  200.0
3    David  30.0  150.0